Rainchus/marioparty4/src/REL/m401Dll/main_ex.c
void fn_2_11EFC(omObjData *object)
{
	UnkWork10A88 *temp_r29;
	temp_r29 = object->data;
	if(object->work[0] == 1) {
		fn_2_10980(temp_r29->unk12);
		omDelObjEx(HuPrcCurrentGet(), object);
	}
}

void fn_2_11FB4(ModelData *model, ParticleData *particle, Mtx matrix)
{
	float temp_f31;
	float temp_f30;
	float temp_f29;
	HsfanimStruct01 *temp_r31;
	s32 temp_r29;
	UnkWork10A88 *temp_r28;
	s32 temp_r27;
	temp_r28 = ((omObjData *)(particle->unk_1C))->data;
	if(particle->unk_34 == 0) {
		temp_r31 = particle->unk_48;
		temp_f29 = 360.0f/(particle->unk_30/2);
		temp_f31 = particle->unk_00;
		for(temp_r29=0; temp_r29<particle->unk_30/2; temp_r29++, temp_r31++) {
			temp_f30 = (0.1f*(rand8() % 50))+50;
			temp_r31->unk2C = (0.1f*(rand8() % 41))+8.0f;
			temp_r31->unk08.x = temp_f31;
			temp_r31->unk08.y = temp_f30;
			temp_r31->unk08.z = 0;
			temp_r31->unk14.x = (10.0f/255.0f)*((u8)frand());
			temp_r31->unk40.a = 180;
			temp_f31 += temp_f29;
			temp_r31->unk34.z = 0;
		}
		for(temp_r29=0; temp_r29<particle->unk_30/2; temp_r29++, temp_r31++) {
			temp_r31->unk2C = 0;
			temp_r31->unk40.a = 0;
		}
	}
	temp_r31 = particle->unk_48;
	temp_r27 = 0;
	for(temp_r29=0; temp_r29<particle->unk_30/2; temp_r29++, temp_r31++) {
		if(temp_r31->unk40.a != 0) {
			temp_r27++;
			temp_f30 = (6.0*sind(temp_r31->unk08.z))+temp_r31->unk08.y;
			temp_r31->unk34.x = temp_f30*cosd(temp_r31->unk08.x);
			temp_r31->unk34.y = temp_f30*sind(temp_r31->unk08.x);
			temp_r31->unk08.z += temp_r31->unk14.x;
			if(temp_r31->unk08.z >= 360.0f) {
				temp_r31->unk08.z -= 360.0f;
			}
			temp_f31 = temp_r31->unk40.a;
			if(temp_r28->unk14) {
				temp_f31 -= 3.0f;
				if(temp_f31 < 0.0f) {
					temp_f31 = 0.0f;
				}
			}
			temp_r31->unk40.a = temp_f31;
		}
	}
	if(!temp_r27) {
		temp_r28->unk10--;
	}
}

void fn_2_123F8(ModelData *model, ParticleData *particle, Mtx matrix)
{
	float temp_f31;
	HsfanimStruct01 *temp_r31;
	s32 temp_r29;
	s32 temp_r28;
	UnkWork10A88 *temp_r27;
	if(!particle->unk_02) {
		particle->unk_02 = 1;
		temp_r31 = particle->unk_48;
		for(temp_r29=0; temp_r29<particle->unk_30/2; temp_r29++, temp_r31++) {
			temp_r31->unk08.x = temp_r31->unk34.x;
			temp_r31->unk14.x = 0;
			temp_r31->unk14.y = 5.0f+((35.0f/255.0f)*((u8)frand()));
			temp_r31->unk14.z = 8.0f+((8.0f/255.0f)*((u8)frand()));
			temp_r31->unk24 = 3.0f+((5.0f/255.0f)*((u8)frand()));
		}
	}
	temp_r31 = particle->unk_48;
	temp_r28 = 0;
	for(temp_r29=0; temp_r29<particle->unk_30/2; temp_r29++, temp_r31++) {
		if(temp_r31->unk40.a != 0) {
			temp_r28++;
			temp_r31->unk34.x = temp_r31->unk08.x+(temp_r31->unk14.z*sind(temp_r31->unk14.x));
			temp_r31->unk14.x += temp_r31->unk14.y;
			if(temp_r31->unk14.x >= 360.0f) {
				temp_r31->unk14.x -= 360.0f;
			}
			temp_r31->unk34.y += temp_r31->unk24;
			temp_f31 = temp_r31->unk40.a;
			temp_f31 -= 3.0f;
			if(temp_f31 < 0.0f) {
				temp_f31 = 0.0f;
			}
			temp_r31->unk40.a = temp_f31;
		}
	}
	if(temp_r28 == 0) {
		UnkWork10A88 *temp_r27 = ((omObjData *)(particle->unk_1C))->data;
		temp_r27->unk10--;
	}
}

//Here exclusively to match fn_2_126C8
static inline void DummyInline(s32 arg0)
{
	s32 temp1, temp2, temp3, temp4, temp5;
	if(arg0 != 0) {
		temp1 = 1;
		temp2 = temp1*2;
		temp3 = temp2*3;
		temp4 = temp3*4;
		temp5 = temp4*5;
		temp5 = temp5/2;
	}
}

void fn_2_126C8(ModelData *model, ParticleData *particle, Mtx matrix)
{
	DummyInline(0);
}

void fn_2_126F4(ModelData *model, ParticleData *particle, Mtx matrix)
{
	HsfanimStruct01 *temp_r31;
	s32 temp_r29;
	s32 temp_r28;
	if(particle->unk_34 == 0) {
		temp_r31 = particle->unk_48;
		for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
			temp_r31->unk40.a = 0;
			temp_r31->unk2C = 0;
		}
		particle->unk_00 = 0;
	}
	if(particle->unk_00 == 0) {
		for(temp_r29=0; temp_r29<2; temp_r29++) {
			temp_r31 = particle->unk_48;
			for(temp_r28=0; temp_r28<particle->unk_30; temp_r28++, temp_r31++) {
				if(temp_r31->unk40.a == 0) {
					break;
				}
			}
			if(temp_r28 == particle->unk_30) {
				continue;
			}
			temp_r31->unk08.x = -50.0f+(0.3921569f*((u8)frand()));
			temp_r31->unk08.y = 0.058823533f*((u8)frand());
			temp_r31->unk14.x = (90.0f/255.0f)*((u8)frand());
			temp_r31->unk14.y = 5.0f+(0.098039225f*((u8)frand()));
			temp_r31->unk14.z = (float)(frand() % 10) + 8.0f;
			temp_r31->unk34.z = -5.0f+((11.0f/255.0f)*((u8)frand()));
			temp_r31->unk34.y = (float)(frand() % 31) + -5.0f;
			temp_r31->unk2C = temp_r31->unk08.y+35.0f;
			temp_r31->unk40.a = 210;
			temp_r31->unk08.y = (0.2*temp_r31->unk08.y)+5.0;
			particle->unk_00 = (frand()%10)+10;
		}
	} else {
		particle->unk_00--;
	}
	temp_r31 = particle->unk_48;
	for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
		if(temp_r31->unk40.a == 0) {
			continue;
		}
		temp_r31->unk34.x = (temp_r31->unk14.z*sind(temp_r31->unk14.x))+temp_r31->unk08.x;
		temp_r31->unk14.x += temp_r31->unk14.y;
		if(temp_r31->unk14.x >= 360.0f) {
			temp_r31->unk14.x -= 360.0f;
		}
		temp_r31->unk34.y += temp_r31->unk08.y;
		temp_r31->unk40.a--;
	}
}

void fn_2_12B30(ModelData *model, ParticleData *particle, Mtx matrix)
{
	HsfanimStruct01 *temp_r31;
	s32 temp_r29;
	M401WorkPlayer *temp_r28;
	omObjData *temp_r27;
	s32 temp_r26;
	s32 temp_r25;
	UnkWork10A88 *temp_r24;
	temp_r27 = particle->unk_1C;
	temp_r24 = ((omObjData *)(particle->unk_1C))->data;
	temp_r28 = temp_r24->unkC->data;
	if(particle->unk_34 == 0) {
		temp_r31 = particle->unk_48;
		for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
			temp_r31->unk40.a = 0;
			temp_r31->unk2C = 0;
			temp_r31->unk20 = 0;
		}
		particle->unk_00 = 0;
	}
	if(particle->unk_00 == 0 && temp_r27->work[0] == 0) {
		for(temp_r29=0; temp_r29<10; temp_r29++) {
			temp_r31 = particle->unk_48;
			for(temp_r26=0; temp_r26<particle->unk_30; temp_r26++, temp_r31++) {
				if(temp_r31->unk20 == 0) {
					break;
				}
			}
			if(temp_r26 == particle->unk_30) {
				continue;
			}
			temp_r31->unk08.x = (((40.0f/255.0f)*((u8)frand()))+(temp_r28->unk18.x-20.0f));
			temp_r31->unk08.y = (frand() % 5)+3;
			temp_r31->unk14.x = ((90.0f/255.0f)*((u8)frand()));
			temp_r31->unk14.y = 5.0f+((45.0f/255.0f)*((u8)frand()));
			temp_r31->unk14.z = 2.0f+(0.011764707f*((u8)frand()));
			temp_r31->unk40.a = 180;
			temp_r31->unk34.z = ((0.121568635f*((u8)frand()))+(temp_r28->unk18.z+70.0f));
			temp_r31->unk34.y = ((0.20000002f*((u8)frand()))+(temp_r28->unk18.y-25.0f));
			particle->unk_00 = (frand()%6)+5;
			temp_r31->unk20 = 1;
			temp_r31->unk2C = 11;
		}
	} else {
		particle->unk_00--;
	}
	temp_r31 = particle->unk_48;
	temp_r25 = 0;
	for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
		if(temp_r31->unk40.a != 0) {
			float temp_f31;
			temp_r31->unk34.x = (temp_r31->unk14.z*sind(temp_r31->unk14.x))+temp_r31->unk08.x;
			temp_r31->unk14.x += temp_r31->unk14.y;
			if(temp_r31->unk14.x >= 360.0f) {
				temp_r31->unk14.x -= 360.0f;
			}
			temp_r31->unk34.y += 3.0f;
			temp_f31 = temp_r31->unk40.a;
			temp_f31 -= temp_r31->unk08.y;
			if(temp_f31 < 0.0f) {
				temp_f31 = 0.0f;
				temp_r31->unk20 = 0;
			}
			
