Rainchus/marioparty4/src/REL/m401Dll/main_ex.c
			temp_r31->unk40.a = temp_f31;
			temp_r25++;
		}
	}
	if(temp_r25 == 0 && temp_r27->work[0] == 1) {
		temp_r27->work[1] = 1;
	}
}

void fn_2_1301C(ModelData *model, ParticleData *particle, Mtx matrix)
{
	HsfanimStruct01 *temp_r31;
	s32 temp_r29;
	M401WorkPlayer *temp_r28;
	omObjData *temp_r27;
	s32 temp_r26;
	s32 temp_r25;
	UnkWork10A88 *temp_r24;
	temp_r27 = particle->unk_1C;
	temp_r24 = (temp_r27)->data;
	temp_r28 = temp_r24->unkC->data;
	if(particle->unk_34 == 0) {
		temp_r31 = particle->unk_48;
		for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
			temp_r31->unk40.a = 0;
			temp_r31->unk2C = 0;
			temp_r31->unk20 = 0;
		}
		particle->unk_00 = 0;
	}
	if(particle->unk_00 == 0 && temp_r27->work[0] == 0) {
		for(temp_r29=0; temp_r29<10; temp_r29++) {
			temp_r31 = particle->unk_48;
			for(temp_r26=0; temp_r26<particle->unk_30; temp_r26++, temp_r31++) {
				if(temp_r31->unk20 == 0) {
					break;
				}
			}
			if(temp_r26 == particle->unk_30) {
				continue;
			}
			temp_r31->unk08.x = (((80.0f/255.0f)*((u8)frand()))+(-40.0f));
			temp_r31->unk08.y = (frand() % 10)+7;
			temp_r31->unk14.x = ((90.0f/255.0f)*((u8)frand()));
			temp_r31->unk14.y = 5.0f+((45.0f/255.0f)*((u8)frand()));
			temp_r31->unk14.z = 2.0f+(frand() % 3);
			temp_r31->unk40.a = 180;
			temp_r31->unk34.z = ((0.121568635f*((u8)frand()))+(85.0f));
			temp_r31->unk34.y = ((0.2392157f*((u8)frand()))+(-30.0f));
			particle->unk_00 = (frand()%3)+3;
			temp_r31->unk20 = 1;
			temp_r31->unk2C = 11;
		}
	} else {
		particle->unk_00--;
	}
	temp_r31 = particle->unk_48;
	temp_r25 = 0;
	for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
		if(temp_r31->unk40.a != 0) {
			float temp_f31;
			temp_r31->unk34.x = (temp_r31->unk14.z*sind(temp_r31->unk14.x))+temp_r31->unk08.x;
			temp_r31->unk14.x += temp_r31->unk14.y;
			if(temp_r31->unk14.x >= 360.0f) {
				temp_r31->unk14.x -= 360.0f;
			}
			temp_r31->unk34.y += 3.0f;
			temp_r31->unk34.z -= 1.0f;
			temp_f31 = temp_r31->unk40.a;
			temp_f31 -= temp_r31->unk08.y;
			if(temp_f31 < 0.0f) {
				temp_f31 = 0.0f;
				temp_r31->unk20 = 0;
			}
			
			temp_r31->unk40.a = temp_f31;
			temp_r25++;
		}
	}
	if(temp_r25 == 0 && temp_r27->work[0] == 1) {
		temp_r27->work[1] = 1;
	}
}

void fn_2_1350C(ModelData *model, ParticleData *particle, Mtx matrix)
{
	float temp_f31;
	float temp_f30;
	float temp_f29;
	float temp_f28;
	HsfanimStruct01 *temp_r31;
	s32 temp_r29;
	s32 temp_r28;
	if(particle->unk_34 == 0) {
		temp_r31 = particle->unk_48;
		for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
			temp_r31->unk2C = 0;
		}
		particle->unk_1C = (void *)1;
		particle->unk_02 = 0;
		particle->unk_00 = 0;
	}
	if(particle->unk_00 == 0) {
		for(temp_r29=0; temp_r29<16; temp_r29++) {
			temp_r31 = particle->unk_48;
			for(temp_r28=0; temp_r28<particle->unk_30; temp_r28++, temp_r31++) {
				if(temp_r31->unk2C == 0) {
					break;
				}
			}
			if(temp_r28 == particle->unk_30) {
				continue;
			}
			temp_f30 = (360.0f/255.0f)*((u8)frand());
			temp_r31->unk20 = 45*sind(temp_f30);
			temp_r31->unk28 = 45*cosd(temp_f30);
			temp_r31->unk24 = 0;
			temp_f28 = 0.098039225f*((u8)frand())+50.0f;
			temp_f29 = (2.0f/255.0f)*((u8)frand())+2.5f;
			temp_r31->unk08.x = temp_f29*sind(temp_f30)*cosd(temp_f28);
			temp_r31->unk08.y = 0.8f*(temp_f29*sind(temp_f28));
			temp_r31->unk08.z = temp_f29*cosd(temp_f30)*cosd(temp_f28);
			temp_r31->unk14.x = 1;
			temp_r31->unk14.y = 255;
			temp_r31->unk2C = (4.0f/255.0f)*((u8)frand())+3.0f;
			temp_r31->unk40.r = (155.0f/255.0f)*((u8)frand())+100.0f;
			temp_r31->unk40.g = 0.21568629f*((u8)frand())+200.0f;
			temp_r31->unk40.b = 255;
			temp_r31->unk40.a = temp_r31->unk14.y;
		}
		particle->unk_00 = 0.058823533f*((u8)frand())+30.0f;
	} else {
		particle->unk_00--;
	}
	temp_r31 = particle->unk_48;
	for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
		if(temp_r31->unk2C != 0) {
			temp_f31 = temp_r31->unk14.x;
			temp_r31->unk34.x = (temp_r31->unk08.x*temp_f31)+temp_r31->unk20;
			temp_r31->unk34.z = (temp_r31->unk08.z*temp_f31)+temp_r31->unk28;
			temp_r31->unk34.y = ((temp_r31->unk08.y*temp_f31)+temp_r31->unk24)-(0.2*temp_f31*temp_f31);
			temp_r31->unk14.y -= 3.5f;
			temp_r31->unk40.a = temp_r31->unk14.y;
			if(temp_r31->unk2C < 0 || temp_r31->unk14.y < 10.0f || temp_r31->unk34.y <= 0.0f) {
				temp_r31->unk2C = 0;
				particle->unk_02++;
			}
			
			temp_r31->unk14.x += 0.7f;
		}
	}
}

void fn_2_13B7C(ModelData *model, ParticleData *particle, Mtx matrix)
{
	float temp_f31;
	float temp_f30;
	float temp_f29;
	float temp_f28;
	HsfanimStruct01 *temp_r31;
	s32 temp_r29;
	s32 temp_r28;
	if(particle->unk_34 == 0) {
		temp_r31 = particle->unk_48;
		for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
			temp_r31->unk2C = 0;
		}
		particle->unk_1C = (void *)1;
		particle->unk_02 = 0;
		particle->unk_00 = 0;
	}
	if(particle->unk_1C) {
		for(temp_r29=0; temp_r29<20; temp_r29++) {
			temp_r31 = particle->unk_48;
			for(temp_r28=0; temp_r28<particle->unk_30; temp_r28++, temp_r31++) {
				if(temp_r31->unk2C == 0) {
					break;
				}
			}
			if(temp_r28 != particle->unk_30) {
				temp_f30 = (360.0f/255.0f)*((u8)frand());
				temp_r31->unk20 = 40*sind(temp_f30);
				temp_r31->unk28 = 40*cosd(temp_f30);
				temp_r31->unk24 = 0;
				temp_f28 = (20.0f/255.0f)*((u8)frand())+70.0f;
				temp_f29 = (4.0f/255.0f)*((u8)frand())+5.0f;
				temp_r31->unk08.x = temp_f29*sind(temp_f30)*cosd(temp_f28);
				temp_r31->unk08.y = temp_f29*sind(temp_f28);
				temp_r31->unk08.z = temp_f29*cosd(temp_f30)*cosd(temp_f28);
				temp_r31->unk14.x = 1;
				temp_r31->unk14.y = 255;
				temp_r31->unk2C = (4.0f/255.0f)*((u8)frand())+5.0f;
				temp_r31->unk40.r = (155.0f/255.0f)*((u8)frand())+100.0f;
				temp_r31->unk40.g = 0.21568629f*((u8)frand())+200.0f;
				temp_r31->unk40.b = 255;
				temp_r31->unk40.a = temp_r31->unk14.y;
			} else {
				particle->unk_1C = NULL;
				break;
			}
		}
	}
	temp_r31 = particle->unk_48;
	for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
		if(temp_r31->unk2C != 0) {
			temp_f31 = temp_r31->unk14.x;
			temp_r31->unk34.x = (temp_r31->unk08.x*temp_f31)+temp_r31->unk20;
			temp_r31->unk34.z = (temp_r31->unk08.z*temp_f31)+temp_r31->unk28;
			temp_r31->unk34.y = ((temp_r31->unk08.y*temp_f31)+temp_r31->unk24)-(0.2*temp_f31*temp_f31);
			temp_r31->unk14.y -= 3.5f;
			temp_r31->unk40.a = temp_r31->unk14.y;
			if(temp_r31->unk2C < 0 || temp_r31->unk14.y < 10.0f || temp_r31->unk34.y <= 0.0f) {
				temp_r31->unk2C = 0;
				particle->unk_02++;
			}
			temp_r31->unk14.x += 1.0f;
		}
	}
	if(particle->unk_02 >= particle->unk_30 && particle->unk_1C == NULL) {
		particle->unk_00 = 1;
	}
}

void fn_2_142D0(omObjData *object);
void fn_2_142D4(ModelData *model, ParticleData *particle, Mtx matrix);

omObjData *fn_2_141B0(void)
{
	omObjData *object = omAddObjEx(HuPrcCurrentGet(), 1300, 5, 0, -1, fn_2_142D0);
	ParticleData *particle;
	omSetStatBit(object, 0x100);
	object->model[0] = Hu3DParticleCreate(lbl_2_bss_244, 200);
	Hu3DParticleHookSet(object->model[0], fn_2_142D4);
	Hu3DParticleColSet(object->model[0], 255, 255, 255);
	Hu3DModelPosSet(object->model[0], 0, 0, 0);
	Hu3DParticleAnimModeSet(object->model[0], 0);
	Hu3DModelLayerSet(object->model[0], 1);
	Hu3DParticleBlendModeSet(object->model[0], 1);
	particle = Hu3DData[object->model[0]].unk_120;
	return object;
}

void fn_2_142D0(omObjData *object)
{
	
