Rainchus/marioparty4/src/REL/m401Dll/main_ex.c
}

void fn_2_142D4(ModelData *model, ParticleData *particle, Mtx matrix)
{
	HsfanimStruct01 *temp_r31;
	s32 temp_r29;
	s32 temp_r28;
	if(particle->unk_34 == 0) {
		temp_r31 = particle->unk_48;
		for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
			temp_r31->unk2C = 0;
			temp_r31->unk34.y = 950;
		}
	}
	if(particle->unk_00 == 0) {
		for(temp_r29=0; temp_r29<30; temp_r29++) {
			temp_r31 = particle->unk_48;
			for(temp_r28=0; temp_r28<particle->unk_30; temp_r28++, temp_r31++) {
				if(temp_r31->unk2C == 0) {
					break;
				}
			}
			if(temp_r28 == particle->unk_30) {
				continue;
			}
			temp_r31->unk2C = 1;
			temp_r31->unk40.a = 150;
			temp_r31->unk34.x = ((11.764707f*((u8)frand()))+(-1500.0f));
			temp_r31->unk34.z = ((6.666667f*((u8)frand()))+(-2000.0f));
			temp_r31->unk08.x = 0;
			temp_r31->unk08.y = (((5.0f/255.0f)*((u8)frand()))+(5.0f));
			temp_r31->unk08.z = ((0.011764707f*((u8)frand()))+(18.0f));
		}
		particle->unk_00 = (frand() % 5)+4;
	} else {
		particle->unk_00--;
	}
	temp_r31 = particle->unk_48;
	for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
		if(temp_r31->unk2C != 0) {
			temp_r31->unk34.x += 1.1f;
			temp_r31->unk34.z += 1.1f;
			temp_r31->unk2C = (temp_r31->unk08.z*sind(temp_r31->unk08.x))+1.0;
			temp_r31->unk08.x += temp_r31->unk08.y;
			if(temp_r31->unk08.x >= 180.0f) {
				temp_r31->unk2C = 0.0f;
			}
		}
	}
}

void fn_2_14738(omObjData *object);
void fn_2_147B4(ModelData *model, ParticleData *particle, Mtx matrix);

omObjData *fn_2_14640(Process *objman)
{
	omObjData *object;
	object = omAddObjEx(objman, 1300, 1, 0, -1, fn_2_14738);
	object->model[0] = Hu3DParticleCreate(lbl_2_bss_250, 450);
	Hu3DParticleHookSet(object->model[0], fn_2_147B4);
	Hu3DParticleColSet(object->model[0], 255, 255, 255);
	Hu3DModelPosSet(object->model[0], 0, -6000, -21000);
	Hu3DParticleAnimModeSet(object->model[0], 0);
	Hu3DModelLayerSet(object->model[0], 1);
	Hu3DParticleBlendModeSet(object->model[0], 1);
	return object;
}

void fn_2_14738(omObjData *object)
{
	omSetTra(object, lbl_2_bss_6C.x, lbl_2_bss_6C.y, lbl_2_bss_6C.z);
	if(object->work[0] == 1) {
		Hu3DModelAttrSet(object->model[0], 1);
		omDelObjEx(HuPrcCurrentGet(), object);
	}
}

void fn_2_147B4(ModelData *model, ParticleData *particle, Mtx matrix)
{
	float temp_f31;
	float temp_f30;
	HsfanimStruct01 *temp_r31;
	s32 temp_r29;
	s32 temp_r28;
	if(particle->unk_34 == 0) {
		temp_r31 = particle->unk_48;
		for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
			temp_r31->unk40.a = 180;
			temp_r31->unk08.x = ((3.9215689f*((u8)frand()))+(-500.0f));
			temp_r31->unk08.y = ((3.529412f*((u8)frand()))+(-500.0f));
			temp_r31->unk08.z = (-300.0f)-((3.9215689f*((u8)frand())));
			temp_r31->unk14.x = (360.0f/255.0f)*((u8)frand());
			temp_r31->unk14.y = (4.0f/255.0f)*((u8)frand());
			temp_r31->unk2C = 2;
		}
		particle->unk_00 = 0;
	}
	if(particle->unk_00 == 0) {
		for(temp_r29=0; temp_r29<2; temp_r29++) {
			temp_r31 = particle->unk_48;
			for(temp_r28=0; temp_r28<particle->unk_30; temp_r28++, temp_r31++) {
				if(temp_r31->unk40.a == 0) {
					break;
				}
			}
			if(temp_r28 == particle->unk_30) {
				continue;
			}
			temp_r31->unk40.a = 180;
			temp_r31->unk08.x = -50.0f+(0.3921569f*((u8)frand()));
			temp_r31->unk08.y = 0.058823533f*((u8)frand());
			temp_r31->unk14.x = (90.0f/255.0f)*((u8)frand());
			temp_r31->unk14.y = 5.0f+(0.098039225f*((u8)frand()));
			temp_r31->unk14.z = (float)(frand() % 10) + 8.0f;
			temp_r31->unk34.z = -5.0f+((11.0f/255.0f)*((u8)frand()));
			temp_r31->unk34.y = (float)(frand() % 31) + -5.0f;
			temp_r31->unk2C = temp_r31->unk08.y+35.0f;
			temp_r31->unk40.a = 210;
			temp_r31->unk08.y = (0.2*temp_r31->unk08.y)+5.0;
			particle->unk_00 = (frand()%10)+10;
		}
		
	} else {
		particle->unk_00--;
	}
	temp_r31 = particle->unk_48;
	temp_f30 = lbl_2_bss_50*0.3f;
	for(temp_r29=0; temp_r29<particle->unk_30; temp_r29++, temp_r31++) {
		if(temp_r31->unk40.a == 0) {
			continue;
		}
		temp_r31->unk34.x = temp_r31->unk08.x;
		temp_r31->unk34.y = temp_r31->unk08.y;
		temp_r31->unk34.z = temp_r31->unk08.z;
		temp_r31->unk08.x -= 0.5*sind(temp_r31->unk14.x);
		temp_r31->unk08.z -= -temp_f30;
		temp_r31->unk14.x += temp_r31->unk14.y;
		if(temp_r31->unk14.x >= 360.0f) {
			temp_r31->unk14.x -= 360.0f;
		}
		if(temp_r31->unk08.z >= 0.0f) {
			temp_f31 = 800.0f+((300.0f/255.0f)*((u8)frand()));
			temp_r31->unk08.z -= temp_f31;
		}
	}
}